### Pandas
- Series: index와 value로 이루어진 데이터타입
- DataFrame : index,column, value로 이루어진 데이터타입

In [2]:
data=pd.Series(np.random.randint(10,size=5))
data

0    7
1    4
2    7
3    2
4    6
dtype: int32

In [3]:
#index설정
data=pd.Series(np.random.randint(10,size=5),
              index=list("ABCDE"))
data

A    8
B    2
C    3
D    2
E    6
dtype: int32

In [4]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([8, 2, 3, 2, 6]))

In [8]:
data["B"], data.B #인덱스 지정해줬을 때

(2, 2)

In [9]:
#브로드캐스팅
data *10

A    80
B    20
C    30
D    20
E    60
dtype: int32

In [10]:
data[["B","E"]]

B    2
E    6
dtype: int32

In [11]:
#offset index
data[2::2]

C    3
E    6
dtype: int32

In [12]:
data[::-1]

E    6
D    2
C    3
B    2
A    8
dtype: int32

In [13]:
# Series 연산
data

A    8
B    2
C    3
D    2
E    6
dtype: int32

In [16]:
data2=pd.Series({"D":3,"E":5,"F":7})
data2

D    3
E    5
F    7
dtype: int64

In [35]:
result = data + data2 # 같은 인덱스끼리 더해짐
result

A     NaN
B     NaN
C     NaN
D     5.0
E    11.0
F     NaN
dtype: float64

In [36]:
result[result.isnull()] = data
result

A     8.0
B     2.0
C     3.0
D     5.0
E    11.0
F     NaN
dtype: float64

In [37]:
result[result.isnull()]= data2
result

A     8.0
B     2.0
C     3.0
D     5.0
E    11.0
F     7.0
dtype: float64

In [ ]:
#DataFrame

In [ ]:
#DF 생성1: 딕셔너리의 리스트

In [38]:
datas={
    "name":["dss","fcamp"],
    "email":["dss@gmail.com","fcamp@daum.net"],
}
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@gmail.com', 'fcamp@daum.net']}

In [39]:
df=pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [ ]:
#DF 생성2: 리스트의 딕셔너리

In [41]:
datas=[
    {"name":"dss","email":"dss@gmail.com"},
    {"name":"fcamp","email":"fcamp@daum.net"},   
]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'fcamp', 'email': 'fcamp@daum.net'}]

In [53]:
df=pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [44]:
#인덱스 추가하는 방법
df=pd.DataFrame(datas,index=["one","two"])
df

      name           email
one    dss   dss@gmail.com
two  fcamp  fcamp@daum.net

In [45]:
df.index

Index(['one', 'two'], dtype='object')

In [46]:
df.columns

Index(['name', 'email'], dtype='object')

In [47]:
df.values

array([['dss', 'dss@gmail.com'],
       ['fcamp', 'fcamp@daum.net']], dtype=object)

In [ ]:
#데이터의 선택 : row, column, (row,column)

In [54]:
#row 선택 : loc (location)
df=pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [55]:
df.loc[1]

name              fcamp
email    fcamp@daum.net
Name: 1, dtype: object

In [56]:
df.loc[1]["email"]

'fcamp@daum.net'

In [60]:
#인덱스 없으면 추가
df.loc[2]={"name":"andy","email":"andy@naver.com"}
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [61]:
# column 선택
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [62]:
df["id"]=""
df

    name           email id
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [63]:
df["id"]=range(1,4)
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [64]:
# row,column 선택

In [65]:
df.loc[[0,2],["email","id"]]

            email  id
0   dss@gmail.com   1
2  andy@naver.com   3

In [66]:
# 칼럼 데이터 순서 설정
df[["id","name","email"]]

   id   name           email
0   1    dss   dss@gmail.com
1   2  fcamp  fcamp@daum.net
2   3   andy  andy@naver.com

In [67]:
# head, tail

In [69]:
df.head() #가장 위 5개

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [70]:
df.tail(2)

    name           email  id
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [71]:
#apply - map과 같은 함수
df

    name           email  id
0    dss   dss@gmail.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [73]:
def domain(email):
    return email.split("@")[1].split(".")[0]
#df["domain"]=df["email"].apply(lambda email: email.split("@")[1].split(".")[0])

domain(df.loc[0]["email"])

'gmail'

In [76]:
df["domain"]=df["email"].apply(domain)
df

    name           email  id domain
0    dss   dss@gmail.com   1  gmail
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [77]:
from makedata import *

In [78]:
get_name()

'Anthony'

In [79]:
get_age()

30

In [86]:
df1=pd.DataFrame(make_data(5))
df1

   Age     Name
0   29  Anthony
1   33     Alan
2   23     Alex
3   34     Alan
4   25     Alex

In [87]:
df2=pd.DataFrame(make_data(5))
df2

   Age    Name
0   21  Arnold
1   32    Alex
2   32    Alan
3   31  Anchal
4   34  Arnold

In [91]:
df3=df1.append(df2)
df3

   Age     Name
0   29  Anthony
1   33     Alan
2   23     Alex
3   34     Alan
4   25     Alex
0   21   Arnold
1   32     Alex
2   32     Alan
3   31   Anchal
4   34   Arnold

In [98]:
#reset_index 인덱스 재정렬
df3.reset_index(drop=True,inplace=True)
df3.tail(2)

   Age    Name
8   31  Anchal
9   34  Arnold

In [97]:
df3=df1.append(df2,ignore_index=True)
df3.tail(2)

   Age    Name
8   31  Anchal
9   34  Arnold

In [104]:
#concat
#row나 column으로 데이터프레임 합칠때
df3=pd.concat([df1,df2]).reset_index(drop=True)
df3.tail(2)

   Age    Name
8   31  Anchal
9   34  Arnold

In [106]:
pd.concat([df3,df1],axis=1)

   Age     Name   Age     Name
0   29  Anthony  29.0  Anthony
1   33     Alan  33.0     Alan
2   23     Alex  23.0     Alex
3   34     Alan  34.0     Alan
4   25     Alex  25.0     Alex
5   21   Arnold   NaN      NaN
6   32     Alex   NaN      NaN
7   32     Alan   NaN      NaN
8   31   Anchal   NaN      NaN
9   34   Arnold   NaN      NaN

In [107]:
pd.concat([df3,df1],axis=1,join="inner")#교집합

   Age     Name  Age     Name
0   29  Anthony   29  Anthony
1   33     Alan   33     Alan
2   23     Alex   23     Alex
3   34     Alan   34     Alan
4   25     Alex   25     Alex

In [108]:
#group by
df=pd.DataFrame(make_data())
df

   Age     Name
0   38  Anthony
1   27  Anthony
2   34   Arnold
3   29     Alex
4   39  Anthony
5   21    Alvin
6   35   Arnold
7   34   Andrew
8   22     Alex
9   38     Adam

In [112]:
#size 개수출력
result_df=df.groupby("Name").size().reset_index(name="count")
result_df

      Name  count
0     Adam      1
1     Alex      2
2    Alvin      1
3   Andrew      1
4  Anthony      3
5   Arnold      2

In [117]:
# sort_values
result_df.sort_values(["count"],inplace=True)
result_df.reset_index(drop=True,inplace=True)
result_df

      Name  count
0     Adam      1
1    Alvin      1
2   Andrew      1
3     Alex      2
4   Arnold      2
5  Anthony      3

In [121]:
#agg
#size,min,max,mean
df.groupby("Name").agg("min").reset_index()

      Name  Age
0     Adam   38
1     Alex   22
2    Alvin   21
3   Andrew   34
4  Anthony   27
5   Arnold   34

In [122]:
df.describe()

             Age
count  10.000000
mean   31.700000
std     6.600505
min    21.000000
25%    27.500000
50%    34.000000
75%    37.250000
max    39.000000

In [ ]:
#merge = sql(join)

In [123]:
# 퀴즈
import makedata

In [129]:
makedata.get_name(), makedata.get_age()

('Billy', 25)

In [125]:
makedata.make_data()

[{'Age': 27, 'Name': 'Billy'},
 {'Age': 37, 'Name': 'Alvin'},
 {'Age': 40, 'Name': 'Anthony'},
 {'Age': 25, 'Name': 'Anthony'},
 {'Age': 40, 'Name': 'Alan'},
 {'Age': 34, 'Name': 'Alex'},
 {'Age': 37, 'Name': 'Alex'},
 {'Age': 34, 'Name': 'Alan'},
 {'Age': 27, 'Name': 'Andrew'},
 {'Age': 25, 'Name': 'Billy'}]

In [135]:
#딕셔너리의 리스트
datas={ }
datas["UserID"]=list(range(1,9))
datas["Age"]=[makedata.get_age() for _ in range(8)]
names=[]
while True:
    name=makedata.get_name()
    if name not in names:
        names.append(name)
    
    if len(names) >= 8:
        break
datas["Name"]=names
user_df=pd.DataFrame(datas)
user_df

   UserID  Age     Name
0       1   25   Anchal
1       2   32   Arnold
2       3   25   Andrew
3       4   29      Jin
4       5   22  Anthony
5       6   20     Adam
6       7   39     Alan
7       8   35     Alex

In [140]:
# 리스트의 딕셔너리
user_df=pd.DataFrame(columns=["UserID","Name","Age"])

for idx in range (1,9):
    name=makedata.get_name()
    while name in list(user_df["Name"]):
        name=makedata.get_name()
    
    data={"UserID":idx,"Name":name,"Age":makedata.get_age()}
    
    user_df.loc[len(user_df)]=data
    
user_df

  UserID    Name Age
0      1  Arnold  24
1      2     Jin  35
2      3   Alvin  28
3      4    Adam  39
4      5  Anchal  32
5      6    Alan  30
6      7   Billy  30
7      8  Andrew  28

In [179]:
#quiz 2
#money_df 만들기

money_df=pd.DataFrame(columns=["ID","Money"])
# id=random.randint(1,8)
# money=random.randint(1,20)*1000
# data={"ID":id,"Money":money}
for i in range(15):
    id=random.randint(1,8)
    money=random.randint(1,20)*1000
    data={"ID":id,"Money":money}
    money_df.loc[i]=data
#money_df

#컬럼데이터에서 unique 값 확인
ids=money_df["ID"].unique()
ids.sort()
ids

array([1, 2, 4, 5, 6, 8], dtype=object)

In [180]:
money_df

   ID  Money
0   1  10000
1   4  12000
2   5   6000
3   4  17000
4   4   1000
5   1   9000
6   2  10000
7   6   9000
8   5   3000
9   4   5000
10  6   1000
11  1  15000
12  2   2000
13  8  17000
14  8  11000

In [186]:
user_df.merge(money_df,left_on="UserID",right_on="ID")

   UserID    Name Age ID  Money
0       1  Arnold  24  1  10000
1       1  Arnold  24  1   9000
2       1  Arnold  24  1  15000
3       2     Jin  35  2  10000
4       2     Jin  35  2   2000
5       4    Adam  39  4  12000
6       4    Adam  39  4  17000
7       4    Adam  39  4   1000
8       4    Adam  39  4   5000
9       5  Anchal  32  5   6000
10      5  Anchal  32  5   3000
11      6    Alan  30  6   9000
12      6    Alan  30  6   1000
13      8  Andrew  28  8  17000
14      8  Andrew  28  8  11000

In [201]:
#컬럼명 변경
user_df.rename(columns={"UserID":"ID"},inplace=True)
user_df

  ID    Name Age
0  1  Arnold  24
1  2     Jin  35
2  3   Alvin  28
3  4    Adam  39
4  5  Anchal  32
5  6    Alan  30
6  7   Billy  30
7  8  Andrew  28

In [191]:
user_df.merge(money_df).tail(2)

   ID    Name Age  Money
13  8  Andrew  28  17000
14  8  Andrew  28  11000

In [192]:
result_df=pd.merge(money_df,user_df)
result_df.tail()

   ID  Money    Name Age
10  2   2000     Jin  35
11  6   9000    Alan  30
12  6   1000    Alan  30
13  8  17000  Andrew  28
14  8  11000  Andrew  28

In [194]:
#group by: sum,size,min..함수 : Series
money_list=result_df.groupby("Name").sum()["Money"].reset_index()
money_list

     Name  Money
0    Adam  35000
1    Alan  10000
2  Anchal   9000
3  Andrew  28000
4  Arnold  34000
5     Jin  12000

In [196]:
#group by: agg("sum"),agg("mean")..: DataFrame
money_list=result_df.groupby("Name").agg("sum").reset_index()[["Name","Money"]]
money_list

     Name  Money
0    Adam  35000
1    Alan  10000
2  Anchal   9000
3  Andrew  28000
4  Arnold  34000
5     Jin  12000

In [197]:
# merge:money_list,user_df:outer

In [200]:
result=pd.merge(user_df,money_list, how="outer")
result

  ID    Name Age    Money
0  1  Arnold  24  34000.0
1  2     Jin  35  12000.0
2  3   Alvin  28      NaN
3  4    Adam  39  35000.0
4  5  Anchal  32   9000.0
5  6    Alan  30  10000.0
6  7   Billy  30      NaN
7  8  Andrew  28  28000.0

In [202]:
# fillna : NaN을 특정 데이터로
result.fillna(value=0,inplace=True)
result

   ID    Name  Age    Money
0   1  Arnold   24  34000.0
1   2     Jin   35  12000.0
2   3   Alvin   28      0.0
3   4    Adam   39  35000.0
4   5  Anchal   32   9000.0
5   6    Alan   30  10000.0
6   7   Billy   30      0.0
7   8  Andrew   28  28000.0

In [203]:
# 정수로 변경
result.dtypes

ID         int64
Name      object
Age        int64
Money    float64
dtype: object

In [205]:
result["Money"]=result["Money"].astype("int")
result

   ID    Name  Age  Money
0   1  Arnold   24  34000
1   2     Jin   35  12000
2   3   Alvin   28      0
3   4    Adam   39  35000
4   5  Anchal   32   9000
5   6    Alan   30  10000
6   7   Billy   30      0
7   8  Andrew   28  28000

In [206]:
result.sort_values("Money",ascending=False)

   ID    Name  Age  Money
3   4    Adam   39  35000
0   1  Arnold   24  34000
7   8  Andrew   28  28000
1   2     Jin   35  12000
5   6    Alan   30  10000
4   5  Anchal   32   9000
2   3   Alvin   28      0
6   7   Billy   30      0

In [207]:
result[:3]

   ID    Name  Age  Money
0   1  Arnold   24  34000
1   2     Jin   35  12000
2   3   Alvin   28      0

In [208]:
np.average(result[:3]["Age"])

29.0